#!/usr/bin/python3
print(1 + 2)    # 加 - 两个对象相加
print(1 - 2)    # 减 - 得到负数或是一个数减去另一个数
print(1 * 2)    # 乘 - 两个数相乘或是返回一个被重复若干次的字符串
print(2 ** 2)   # 幂 - 返回x的y次幂
print(1 / 2)    # 除 - x 除以 y
print(1 // 2)   # 取整除 - 返回商的整数部分
print(1 % 2)    # 取模 - 返回除法的余数
print(1 == 2)   # 等于 - 比较对象是否相等
print(1 != 2)   # 不等于 - 比较两个对象是否不相等
print(1 > 2)    # 大于 - 返回x是否大于y
print(1 >= 2)   # 大于等于 - 返回x是否大于等于y。
print(1 < 2)    # 小于 - 返回x是否小于y。所有比较运算符返回1表示真，返回0表示假。这分别与特殊的变量True和False等价。注意，这些变量名的大写
print(1 <= 2)   # 小于等于 - 返回x是否小于等于y

